app/views/contacts/index.html.erb


<h1><%= "#{t('messages.listing')} #{Contact.model_name.human(count: @contacts.count)}" %></h1>
---
SELECT "contacts".* FROM "contacts"