app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "novo contato"], ["email", "novo@gmail.com"], ["kind_id", 2], ["rmk", "novo ctt"], ["created_at", "2020-01-15 00:20:47.386624"], ["updated_at", "2020-01-15 00:20:47.386624"]]

    def set_options_select
      @kind_options_select = Kind.all
---
SELECT "kinds".* FROM "kinds"

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]